tap "homebrew/cask-versions"
tap "homebrew/services"

# Unix
brew "git"
brew "git-lfs"
brew "jq"
brew "yq"
brew "wget"
brew "openssl"
brew "thoughtbot/formulae/rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "tree"
brew "watch"
brew "watchman"
brew "httpie"
brew "zsh"

# PaaS managers
brew "awscli"
brew "circleci"
brew "contentful-cli"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kubectx"
brew "kops"
brew "packer"
brew "ansible"
brew "terraform"
brew "terragrunt"
brew "heroku/brew/heroku"

# Fun
brew "exercism"
brew "subliminal"

# GitHub + GitLab
brew "hub"
brew "zaquestion/tap/lab"
brew "jesseduffield/lazygit/lazygit"

# Programming language prerequisites and package managers
brew "libyaml" # should come after openssl
brew "coreutils"
brew "yarn"

brew "nodenv"
brew "nodenv/nodenv/node-build-update-defs"
brew "rbenv"
brew "php"
brew "python"

# Databases (using Docker instead)
# brew "postgres", restart_service: :changed
# brew "redis", restart_service: :changed

# Docker
brew "wagoodman/dive/dive"

# Utils
brew "mkcert"

# GUI apps
cask "alfred3"
cask "authy"
cask "boom-3d"
cask "dash"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox-developer-edition"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hazeover"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "ngrok"
cask "notion"
cask "onyx"
cask "postman"
cask "protonvpn"
cask "rectangle"
cask "sketch"
cask "skype"
cask "slack"
cask "softu2f
cask "spotify"
cask "tableplus"
cask "telegram"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zeplin"
cask "zoomus"

# mac App Store
mas "GIPHY CAPTURE", id: 668208984
mas "ColorSlurp", id: 1287239339
mas "ForkLift", id: 412448059
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1449412482
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Trello", id: 1278508951
mas "Glance", id: 1513574319
mas "uBlock", id: 1385985095
