tap "homebrew/cask-versions"
tap "homebrew/services"

# Unix
brew "git"
brew "git-lfs"
brew "openssl"
brew "thoughtbot/formulae/rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watch"
brew "watchman"
brew "httpie"
brew "zsh"

# PaaS managers
brew "awscli"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kubectx"
brew "kops"
brew "packer"
brew "terraform"
brew "heroku/brew/heroku"

# Fun
brew "exercism"
brew "subliminal"

# GitHub + GitLab
brew "hub"
brew "zaquestion/tap/lab"
brew "jesseduffield/lazygit/lazygit"

# Programming language prerequisites and package managers
brew "libyaml" # should come after openssl
brew "coreutils"
brew "yarn"
cask "gpg-suite"

# Databases
brew "postgres", restart_service: :changed
brew "redis", restart_service: :changed

# GUI apps
cask "alfred"
cask "boom-3d"
cask "dash"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox-developer-edition"
cask "github"
cask "google-chrome"
cask "hazeover"
cask "iina-beta"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "mattermost"
cask "postman"
cask "protonvpn"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zeplin"
cask "whatsapp"

# mac App Store
mas "GIPHY CAPTURE", id: 668208984
mas "Just Color Picker", id: 886547068
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 880001334
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Trello", id: 1278508951
